In [12]:
from google.colab import drive
drive.mount('/content/drive',force_remount=True)

Mounted at /content/drive

In [13]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [14]:
for i in range(1,11):
  print(i)

1
2
3
4
5
6
7
8
9
10

In [ ]:
ll = [1,2,3,4,5,6,7,8,9,10]

In [ ]:
sum=0
for val in ll :
 sum= sum+ val
print(sum)

55

In [ ]:
def sum_numbers(my_list):
  sum=0
  for val in ll :
    sum= sum+ val
  return sum 
sum= sum_numbers(ll)
print(sum)

55

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import seaborn as sns

from sklearn.model_selection import train_test_split

from sklearn.metrics import accuracy_score

In [15]:
df = pd.read_csv("/content/drive/MyDrive/BSc Batch 24/AI Module/Titanic dataset - Titanic dataset.csv")

In [16]:
df.shape

(891, 12)

In [17]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [19]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [20]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
df.isnull().sum()*100/df.shape[0]

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [22]:
df['Age'].max(),df['Age'].min(),df['Age'].mean(),df['Age'].mode()

(80.0, 0.42, 29.69911764705882, 0    24.0
 dtype: float64)

In [23]:
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [24]:
type(11)

int

In [25]:
len(df.columns)

12